Tekla Open API Reference for Tekla Structures 2025
AnalysisPartCompositeProperties.CompositeBeamWidthEnum Enumeration
 The composite beam width options.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum CompositeBeamWidthEnum
Public Enumeration CompositeBeamWidthEnum
Members
Member name | Value | Description
COMPOSITE_BEAM_WIDTH_MANUAL | 0 |  The composite beam width is set manually.
COMPOSITE_BEAM_WIDTH_AUTOMATIC | 1 |  The composite beam width is set automatically.
See Also
Reference
Tekla.Structures.Analysis Namespace